spec/fixtures/invoice_payment_succeeded.json

{
  "id":"invoice.payment_succeeded",
  "object":"event",
  "api_version":"2014-09-08",
  "created":1488513115,
  "data":{
    "object":{
      "id":"in_19t7SQBUJrvTTawzmOi63bs9",
      "object":"invoice",
      "amount_due":1600,
      "application_fee":null,
      "attempt_count":0,
      "attempted":true,
      "charge":"ch_19t7SRBUJrvTTawza1GkQNVc",
      "closed":true,
      "currency":"usd",
      "customer":"cus_ADYZEwja7LJrLz",
      "date":1488513114,
      "description":null,
      "discount":null,
      "ending_balance":0,
      "forgiven":false,
      "lines":{
        "object":"list",
        "data":[
          {
            "id":"sub_42",
            "object":"line_item",
            "amount":1600,
            "currency":"usd",
            "description":null,
            "discountable":true,
            "livemode":false,
            "metadata":{

            },
            "period":{
              "start":1488513114,
              "end":1491191514
            },
            "plan":{
              "id":"membership-2017-16",
              "object":"plan",
              "amount":1600,
              "created":1488488386,
              "currency":"usd",
              "interval":"month",
              "interval_count":1,
              "livemode":false,
              "metadata":{

              },
              "name":"Techlahoma Monthly Membership $16",
              "statement_descriptor":null,
              "trial_period_days":null,
              "statement_description":null
            },
            "proration":false,
            "quantity":1,
            "subscription":null,
            "subscription_item":"si_19t7SQBUJrvTTawz9ollbffT",
            "type":"subscription"
          }
        ],
        "has_more":false,
        "total_count":1,
        "url":"/v1/invoices/in_19t7SQBUJrvTTawzmOi63bs9/lines"
      },
      "livemode":false,
      "metadata":{

      },
      "next_payment_attempt":null,
      "paid":true,
      "period_end":1488513114,
      "period_start":1488513114,
      "receipt_number":null,
      "starting_balance":0,
      "statement_descriptor":null,
      "subscription":"sub_42",
      "subtotal":1600,
      "tax":null,
      "tax_percent":null,
      "total":1600,
      "webhooks_delivered_at":null,
      "statement_description":null,
      "payment":"ch_19t7SRBUJrvTTawza1GkQNVc"
    }
  },
  "livemode":false,
  "pending_webhooks":1,
  "request":"req_ADYZqUfU2LwKai",
  "type":"invoice.payment_succeeded"
}
